[
  {
    "name": "A-*",
    "celeb": "Janeane Garofalo",
    "imageSrc": "/images/asexual.jpg",
    "flagSrc": "/images/asexual-flag.png",
    "types": [
      {
        "name": "Asexual",
        "definition": "A person who does not experience sexual attraction to others."
      },
      {
        "name": "Aromantic",
        "definition": "A person who does not experience romantic attraction to others."
      },
      {
        "name": "Agender",
        "definition": "A person who identifies as neither male nor female, or as neutral in terms of gender."
      }
    ]
  },
  {
    "name": "Androgynous",
    "celeb": "Tilda Swinton",
    "imageSrc": "/images/androgynous.jpg",
    "flagSrc": "/images/androgynous-flag.jpg",
    "types": [
      {
        "name": "sexual",
        "definition": "A person who does not adhere to traditional gender roles and may have a mix of masculine and feminine characteristics."
      },
      {
        "name": "romantic",
        "definition": "A person who does not adhere to traditional romantic roles based on gender."
      },
      {
        "name": "gender",
        "definition": "A person whose gender identity is a blend of male and female characteristics, or is indeterminate."
      }
    ]
  },
  {
    "name": "Bi-*",
    "celeb": "Tyler Blackburn",
    "imageSrc": "/images/bisexual.jpg",
    "flagSrc": "/images/bisexual-flag.jpg",
    "types": [
      {
        "name": "Bi-sexual",
        "definition": "A person who experiences sexual attraction to others without regard to gender, or to multiple genders."
      },
      {
        "name": "Bi-romantic",
        "definition": "A person who experiences romantic attraction to others without regard to gender, or to multiple genders."
      },
      {
        "name": "Bi-gender",
        "definition": "A person who identifies as having two distinct gender identities, either simultaneously or alternately."
      }
    ]
  },
  {
    "name": "Demi-*",
    "celeb": "",
    "imageSrc": "/images/demisexual.jpg",
    "flagSrc": "/images/demisexual-flag.png",
    "types": [
      {
        "name": "Demi-sexual",
        "definition": "A person who experiences sexual attraction only after forming a deep emotional bond with someone."
      },
      {
        "name": "Demi-romantic",
        "definition": "A person who experiences romantic attraction only after forming a deep emotional bond with someone."
      }
    ]
  },
  {
    "name": "Gay",
    "celeb": "Neil Patrick Harris",
    "imageSrc": "/images/gay.jpg",
    "flagSrc": "/images/gay-flag.jpg",
    "types": [
      {
        "name": "sexual",
        "definition": "A person who is primarily attracted to people of the same gender."
      },
      {
        "name": "romantic",
        "definition": "A person who is primarily romantically attracted to people of the same gender."
      }
    ]
  },
  {
    "name": "Gender-*",
    "celeb": "Ruby Rose",
    "imageSrc": "/images/genderfluid.jpg",
    "flagSrc": "/images/genderfluid-flag.png",
    "types": [
      {
        "name": "Gender-fluid",
        "definition": "A person whose gender identity fluctuates or varies over time. They may identify with different genders at different times or in different circumstances."
      },
      {
        "name": "Gender-queer",
        "definition": "A person whose gender identity is outside the traditional binary classification of male or female. They may identify with a gender that is neither exclusively male nor female, a combination of both, or a different gender altogether."
      }
    ]
  },
  {
    "name": "Lesbian",
    "celeb": "Sarah Paulson",
    "imageSrc": "/images/lesbian.jpg",
    "flagSrc": "/images/lesbian-flag.jpg",
    "types": [
      {
        "name": "sexual",
        "definition": "A woman who is primarily attracted to other women."
      },
      {
        "name": "romantic",
        "definition": "A woman who is primarily romantically attracted to other women."
      }
    ]
  },
  {
    "name": "Non-binary",
    "celeb": "Jonathan Van Ness",
    "imageSrc": "/images/nonbinary.jpg",
    "flagSrc": "/images/nonbinary-flag.jpg",
    "types": [
      {
        "name": "gender",
        "definition": "A person whose gender identity is not exclusively male or female. They may identify as both, neither, a mix of both, or as a different gender altogether."
      }
    ]
  },
  {
    "name": "Omni-*",
    "types": [
      {
        "name": "Omni-sexual",
        "definition": "A person who is attracted to individuals of all genders, but gender plays a role in their attraction. They recognize gender as a factor in their attraction."
      },
      {
        "name": "Omni-romantic",
        "definition": "A person who experiences romantic attraction to individuals of all genders, but gender plays a role in their attraction. They recognize gender as a factor in their romantic attraction."
      },
      {
        "name": "Omni-gender",
        "definition": "A person whose gender identity encompasses many or all genders. They may experience a connection to multiple genders at once."
      }
    ]
  },
  {
    "name": "Pan-*",
    "imageSrc": "/images/pansexual.jpg",
    "types": [
      {
        "name": "Pan-sexual",
        "definition": "A person who is attracted to others regardless of their gender identity. They may feel attracted to individuals of any gender."
      },
      {
        "name": "Pan-romantic",
        "definition": "A person who experiences romantic attraction to others regardless of their gender identity. They may feel romantic attraction towards individuals of any gender."
      },
      {
        "name": "Pan-gender",
        "definition": "A person whose gender identity encompasses all genders. They may identify with multiple genders simultaneously or fluctuate between them."
      }
    ]
  },
  {
    "name": "Poly-*",
    "imageSrc": "/images/polisexual.jpg",
    "types": [
      {
        "name": "Poly-sexual",
        "definition": "A person who is attracted to multiple genders, but not necessarily all genders."
      },
      {
        "name": "Poly-romantic",
        "definition": "A person who is romantically attracted to multiple genders, but not necessarily all genders."
      },
      {
        "name": "Poly-gender",
        "definition": "A person who may identify with multiple genders."
      }
    ]
  },
  {
    "name": "Queer",
    "imageSrc": "/images/queer.jpg",
    "types": [
      {
        "name": "sexual",
        "definition": "A term used by some individuals to describe their sexual orientation or gender identity in a way that does not conform to societal norms."
      },
      {
        "name": "romantic",
        "definition": "A term used by some individuals to describe their romantic orientation in a way that does not conform to societal norms."
      },
      {
        "name": "gender",
        "definition": "A term used by some individuals to describe their gender identity in a way that does not conform to societal norms."
      }
    ]
  },
  {
    "name": "Trans-*",
    "imageSrc": "/images/trans-woman.jpg",
    "celeb": "Valentina Sampaio",
    "types": [
      {
        "name": "Trans-sexual",
        "definition": "A person who has undergone medical treatments to change their physical sex characteristics to align with their gender identity."
      },
      {
        "name": "Trans-gender",
        "definition": "A person whose gender identity differs from the sex they were assigned at birth."
      }
    ]
  },
  {
    "name": "Two-spirit",
    "types": [
      {
        "name": "gender",
        "definition": "A term used by some Indigenous North American cultures to describe a person who embodies both masculine and feminine qualities, often possessing a spiritual role."
      }
    ]
  }
]
